app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.all
---
SELECT "institutions".* FROM "institutions"