app/controllers/orders_controller.rb

SELECT MIN("orders"."date_st") FROM "orders" WHERE "orders"."institution_id" = ?  [["institution_id", 14]]
SELECT MAX("orders"."date_fn") FROM "orders" WHERE "orders"."institution_id" = ?  [["institution_id", 14]]
SELECT "orders".* FROM "orders" WHERE "orders"."institution_id" = ? AND ("orders"."date_st" BETWEEN '2016-12-01' AND '2016-12-31')  ORDER BY "orders"."date_st" DESC  [["institution_id", 14]]
---
  def index
    get_ghInstitution(14)

    date_today = Date.today
    $ghOrders.merge!({date_filter: params[:date_filter].to_date}) unless params[:date_filter].blank?
    $ghOrders.merge!({date_filter: date_today}) if $ghOrders[:date_filter].blank?

    date_min = Order.select(:date_st).where(institution_id: $ghInstitution[:id]).minimum(:date_st)
    date_max = Order.select(:date_fn).where(institution_id: $ghInstitution[:id]).maximum(:date_fn)

    $ghOrders.merge!(date_min: date_min.nil? ? date_today.beginning_of_month : date_min.beginning_of_month, date_max: date_max.nil? ? date_today : date_max)

    @orders = Order.where(institution_id: $ghInstitution[:id], date_st: $ghOrders[:date_filter].beginning_of_month..$ghOrders[:date_filter].end_of_month).order(date_st: :desc)