app/controllers/receipts_controller.rb

SELECT "so_products".* FROM "so_products" WHERE "so_products"."supplier_order_id" = ?  ORDER BY "so_products"."date" ASC  [["supplier_order_id", 17]]
INSERT INTO "receipts" ("institution_id", "supplier_order_id", "contract_number", "invoice_number", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "receipt_products" ("date", "receipt_id", "product_id", "count_fact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2016-12-20"], ["receipt_id", 54], ["product_id", 1], ["count_fact", 5.0], ["created_at", "2016-12-28 10:09:35.517559"], ["updated_at", "2016-12-28 10:09:35.517559"]]
---
  def create

    institution_id = 14
    supplier_order_id = params[:supplier_order_id]
    contract_number = params[:contract_number]
    invoice_number = params[:invoice_number]

    receipt_id = 0
    SupplierOrder.where(id: supplier_order_id).first.so_products.order(:date).each_with_index do |so_product, index_sop|

      receipt_id = Receipt.create!(institution_id: institution_id, supplier_order_id: supplier_order_id, contract_number: contract_number,
                                invoice_number: invoice_number, date: Date.today.strftime("%Y-%m-%d")).id if index_sop == 0

      ReceiptProduct.create!(date: so_product.date, receipt_id: receipt_id, product_id: so_product.product_id, count_fact: so_product.count)

SELECT  "supplier_orders".* FROM "supplier_orders"  ORDER BY "supplier_orders"."id" ASC LIMIT 1
SELECT "receipts".* FROM "receipts" WHERE "receipts"."supplier_order_id" = ?  [["supplier_order_id", 1]]
---
  def index
    @supplier_orders = SupplierOrder.all
    @receipts = Receipt.where(supplier_order_id: @supplier_orders.first.id)

SELECT "receipts".* FROM "receipts" WHERE "receipts"."supplier_order_id" = ?  [["supplier_order_id", 3]]
SELECT DISTINCT "so_products"."contract_number" FROM "so_products" WHERE "so_products"."supplier_order_id" = ?  [["supplier_order_id", 143]]
---
  def ajax_get_receipts_for_table
    @receipts = Receipt.where(supplier_order_id: params[:supplier_order_id])
    @contracts = SoProduct.select(:contract_number).distinct(:contract_number).where(supplier_order_id: params[:supplier_order_id] )

SELECT  "receipt_products".* FROM "receipt_products" WHERE "receipt_products"."receipt_id" = ?  ORDER BY "receipt_products"."date" ASC LIMIT 1  [["receipt_id", 6]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 48]]
SELECT  "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT 1  [["id", 6]]
---
  def products
    @receipt_products = ReceiptProduct.where(receipt_id: params[:receipt_id]).order(:date)
    @receipt = @receipt_products.first.receipt

UPDATE "receipt_products" SET "count_fact" = '10' WHERE "receipt_products"."id" = ?  [["id", 91]]
---
  def products_update
    ReceiptProduct.where(id: params[:receipt_product_id]).update_all(count_fact: params[:count_fact])

SELECT "supplier_orders".* FROM "supplier_orders" WHERE "supplier_orders"."supplier_id" = ?  [["supplier_id", 1]]
---
  def ajax_get_supplier_orders_for_select
    @supplier_orders = SupplierOrder.where(supplier_id: params[:supplier_id])

SELECT DISTINCT "so_products"."contract_number" FROM "so_products" WHERE "so_products"."supplier_order_id" = ?  [["supplier_order_id", 2]]
---
  def ajax_get_contracts_for_select
    @contracts = SoProduct.select(:contract_number).distinct(:contract_number).where(supplier_order_id: params[:supplier_order_id] )