app/controllers/sync_catalogs_controller.rb

def branch_update
    Branch.create!(code: params[:code], name: params[:name]) if Branch.where(code: params[:code]).update_all(name: params[:name]).zero?
---
INSERT INTO "branches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-01-05 09:40:55.109850"], ["updated_at", "2017-01-05 09:40:55.109850"]]
UPDATE "branches" SET "name" = NULL WHERE "branches"."code" IS NULL

 def institution_update
    branch = Branch.find_by code: params[:branch_code]
    Institution.create!(code: params[:code], name: params[:name], branch_id: branch.id) if Institution.where(code: params[:code]).update_all(name: params[:name], branch_id: branch.id).zero?
---
SELECT  "branches".* FROM "branches" WHERE "branches"."code" IS NULL LIMIT 1
INSERT INTO "institutions" ("branch_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["branch_id", 3], ["created_at", "2017-01-05 09:51:50.845307"], ["updated_at", "2017-01-05 09:51:50.845307"]]
UPDATE "branches" SET "name" = NULL, "branch_id" = 3 WHERE "branches"."code" IS NULL
UPDATE "institutions" SET "name" = NULL, "branch_id" = 3 WHERE "institutions"."code" IS NULL

def product_update
    Product.create!(code: params[:code], name: params[:name]) if Product.where(code: params[:code]).update_all(name: params[:name]).zero?
---
INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-01-05 09:52:13.544692"], ["updated_at", "2017-01-05 09:52:13.544692"]]
UPDATE "products" SET "name" = NULL WHERE "products"."code" IS NULL

def supplier_update
    Supplier.create!(code: params[:code], name: params[:name]) if Supplier.where(code: params[:code]).update_all(name: params[:name]).zero?
---
INSERT INTO "suppliers" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-01-05 09:48:23.993170"], ["updated_at", "2017-01-05 09:48:23.993170"]]
UPDATE "suppliers" SET "name" = NULL WHERE "suppliers"."code" IS NULL