app/controllers/sync_branchs_controller.rb

SELECT  "branches".* FROM "branches" WHERE "branches"."code" = ? LIMIT 1  [["code", "1223"]]
INSERT INTO "branches" ("code", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["code", "1223"], ["name", "namedd_suplier3"], ["created_at", "2017-01-05 08:44:13.804327"], ["updated_at", "2017-01-05 08:44:13.804327"]]
---
  def create
    branch = Branch.find_by code: branch_params["code"]

    if branch
        branch.name = branch_params["name"]
    else
        branch = Branch.new(branch_params)
    end

    respond_to do |format|
      if branch.save