app/controllers/sync_products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."code" = ? LIMIT 1  [["code", "1223"]]
INSERT INTO "products" ("code", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["code", "1223"], ["name", "namedd_sdddduplier3"], ["created_at", "2017-01-05 08:57:20.454085"], ["updated_at", "2017-01-05 08:57:20.454085"]]
---
  def create
    product = Product.find_by code: product_params["code"]

    if product
        product.name = product_params["name"]
    else
        product = Product.new(product_params)
    end

    respond_to do |format|
      if product.save