app/controllers/sync_suppliers_controller.rb

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."code" = ? LIMIT 1  [["code", 123]]
INSERT INTO "suppliers" ("code", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["code", 123], ["name", "name_suplier"], ["created_at", "2017-01-05 08:04:48.158091"], ["updated_at", "2017-01-05 08:04:48.158091"]]
---
  def create
    supplier = Supplier.find_by code: supplier_params["code"]

    if supplier
        supplier.name = supplier_params["name"]
    else
        supplier = Supplier.new(supplier_params)
    end

    respond_to do |format|
      if supplier.save