app/controllers/sync_institutions_controller.rb

SELECT  "institutions".* FROM "institutions" WHERE "institutions"."code" = ? LIMIT 1  [["code", 123]]
SELECT  "branches".* FROM "branches" WHERE "branches"."code" = ? LIMIT 1  [["code", "0003"]]
INSERT INTO "institutions" ("name", "code", "branch_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "name_suplier2"], ["code", 123], ["branch_id", 1], ["created_at", "2017-01-05 08:33:13.654969"], ["updated_at", "2017-01-05 08:33:13.654969"]]
---
  def create
    institution = Institution.find_by code: institution_params["code"]

    if institution
        institution.name = institution_params["name"]
    else
        institution = Institution.new
        institution.name = institution_params["name"]
        institution.code = institution_params["code"]
    end

    branch = Branch.find_by code: institution_params["branch_code"]
    institution.branch_id = branch.id

    respond_to do |format|
      if institution.save