app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "is_admin", "is_supplier", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[user_params])

    if @user.save