app/views/receipts/products.html.erb

SELECT "suppliers".* FROM "suppliers"
---
    <%= form_tag receipts_path, method: :post, class: "create-receipt" do %>
      <%= collection_select :supplier, :id, Supplier.all, :id, :name, { prompt: "Виберіть постачальника" }, { 'data-ajax-path': ajax_get_supplier_orders_for_select_path } %>